InformationRegisters/СтавкиАкциза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СтавкиАкциза</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкруглятьДоЦелого</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодВидаПодакцизногоТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыВидовПодакцизныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПорядокУплатыАкцизов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПорядокУплатыАкцизов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЛьготныйСрокУплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвансыПриЗакупкеСырья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Импорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Производство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодакцизныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыПартий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СобственныеЗапасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДавальческоеСырье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыНаКомиссии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПодакцизныхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыПодакцизныхТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нефтепродукты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спирт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпиртосодержащаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НефтяноеСырье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СахаросодержашиеНапитки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтомобилиИМотоциклы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КодыВидовПодакцизныхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>КодыВидовПодакцизныхТоваров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодакцизныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УчетАкцизовУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает единицу измерения по ставке акциза
//
// Параметры:
//  КодВидаПодакцизногоТовара- СправочникСсылка.КодыВидовПодакцизногоТовара - ссылка на справочник для получения единицы измерения из регистра
// 
// Возвращаемое значение:
//  ЕдиницаИзмерения - СправочникСсылка.ЕдиницыИзмерения - единица измерения по ставке акциза
//
Функция ПолучитьЕдиницуИзмеренияПоСтавкеАкциза(КодВидаПодакцизногоТовара) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("КодТовара", КодВидаПодакцизногоТовара);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиАкцизаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.СтавкиАкциза.СрезПоследних(&Дата, КодВидаПодакцизногоТовара = &КодТовара) КАК СтавкиАкцизаСрезПоследних";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ЕдиницаИзмерения;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает список производимых подакцизных товаров
//
// Параметры:
//  Организация- СправочникСсылка.Организации - ссылка на справочник для получения производимых подакцизных товаров
// 
// Возвращаемое значение:
//  СписокВидовТоваров - Массив - Массив видов подакцизных товаров по организации
//
Функция СписокПроизводимыхПодакцизныхТоваров(Организация) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара
	|ИЗ
	|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
	|ГДЕ
	|	ПорядокУплатыАкцизов.Организация = &Организация
	|	И ПорядокУплатыАкцизов.Производство = ИСТИНА";
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Список = Новый СписокЗначений();
	Список = Результат.ВыгрузитьКолонку("ВидТовара");
	
	Возврат Список;
	
КонецФункции

// Возвращает список производимых подакцизных товаров
//
// Параметры:
//  Организация- СправочникСсылка.Организации - ссылка на справочник для получения производимых подакцизных товаров
// 
// Возвращаемое значение:
//  ЕстьНастройкиПоАкцизамПоПроизводству - Булево - Есть настройки уплаты акцизов по организациям
//
Функция ЕстьНастройкиПоАкцизамПоПроизводству(Организация = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	
	Если Организация = Неопределено Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара
		|ИЗ
		|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
		|ГДЕ
		|	ПорядокУплатыАкцизов.Производство = ИСТИНА";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара
		|ИЗ
		|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
		|ГДЕ
		|	ПорядокУплатыАкцизов.Производство = ИСТИНА
		|	И ПорядокУплатыАкцизов.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Организация",Организация);
		
	КонецЕсли;
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Возвращает список производимых подакцизных товаров
//
// Параметры:
//  Организация- СправочникСсылка.Организации - ссылка на справочник для получения производимых подакцизных товаров
// 
// Возвращаемое значение:
//  ЕстьНастройкиПоАкцизамПоПроизводству - Булево - Есть настройки уплаты акцизов по организациям
//
Функция ЕстьНастройкиПоАкцизамПоИмпорту(Организация = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	
	Если Организация = Неопределено Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара
		|ИЗ
		|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
		|ГДЕ
		|	ПорядокУплатыАкцизов.Импорт = ИСТИНА";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара
		|ИЗ
		|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
		|ГДЕ
		|	ПорядокУплатыАкцизов.Импорт = ИСТИНА
		|	И ПорядокУплатыАкцизов.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Организация",Организация);
		
	КонецЕсли;
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Возвращает список импортируемых подакцизных товаров
//
// Параметры:
//  Организация- СправочникСсылка.Организации - ссылка на справочник для получения производимых подакцизных товаров
// 
// Возвращаемое значение:
//  СписокВидовТоваров - Массив - Массив видов подакцизных товаров по организации
//
Функция СписокИмпортируемыхПодакцизныхТоваров(Организация) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара
	|ИЗ
	|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
	|ГДЕ
	|	ПорядокУплатыАкцизов.Организация = &Организация
	|	И ПорядокУплатыАкцизов.Импорт = ИСТИНА";
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Список = Новый СписокЗначений();
	Список = Результат.ВыгрузитьКолонку("ВидТовара");
	
	Возврат Список;
	
КонецФункции

// Возвращает ставку акциза по виду подакцизного товара
//
// Параметры:
//  КодВидаПодакцизногоТовара- СправочникСсылка.КодыВидовПодакцизногоТовара - ссылка на справочник для получения единицы измерения из регистра
//  Дата - Дата - дата на которую получается ставка
// 
// Возвращаемое значение:
//  СтруктураВозврата - Струткура - структура ставки акциза на дату
Функция ПолучитьСтавкуАкциза(КодВидаПодакцизногоТовара, Дата) Экспорт
	
	СтруктураВозврата = Новый Структура("Ставка, ОкруглятьДоЦелого", 0, Ложь);
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиАкцизаСрезПоследних.Сумма КАК Сумма,
	|	СтавкиАкцизаСрезПоследних.ОкруглятьДоЦелого КАК ОкруглятьДоЦелого
	|ИЗ
	|	РегистрСведений.СтавкиАкциза.СрезПоследних(&Дата, КодВидаПодакцизногоТовара = &КодВидаПодакцизногоТовара) КАК СтавкиАкцизаСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("КодВидаПодакцизногоТовара", КодВидаПодакцизногоТовара);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		СтруктураВозврата.Ставка            = Результат.Сумма;
		СтруктураВозврата.ОкруглятьДоЦелого = Результат.ОкруглятьДоЦелого;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
		
КонецФункции

// Возвращает структуру параметров заполнения данных по акцизам
//
// Возвращаемое значение:
//  СтруктураВозврата - Струткура - структура параметров заполнения данных по акцизам
Функция ПараметрыДляЗаполненияДанныхПоАкцизам() Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("Импорт",               Ложь);
	Параметры.Вставить("ЭкспортПриРеализации", Ложь);
	Параметры.Вставить("Корректировка",        Ложь);
	Параметры.Вставить("ЗаявлениеОВвозе",      Ложь);
	Параметры.Вставить("ЭтоПередачаТоваров",   Ложь);
	
	Возврат Параметры;

КонецФункции

// Заполняет табличную часть данными по акцизам
//
// Параметры:
//  ТаблицаТовары- ТабличнаяЧасть - табличная часть документа для заполнения
//  Организация- СправочникСсылка.Организации - ссылка на организацию из документа
//  Дата - Дата - дата на которую получается ставка
//  ПараметрыДляЗаполнения- Структура - структура параметров для  заполнения табличной части
// 
Процедура ЗаполнитьДанныеПоАкцизам(ТаблицаТовары, Организация, Дата, ПараметрыДляЗаполнения) Экспорт
	
	Если ТаблицаТовары = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара
		|ПОМЕСТИТЬ СписокУчитываемыхПодакцизныхТоваров
		|ИЗ
		|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
		|ГДЕ
		|	ПорядокУплатыАкцизов.Организация = &Организация
		|	И ПорядокУплатыАкцизов.Производство = &Производство
		|	И ПорядокУплатыАкцизов.Импорт = &Импорт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.КодВидаПодакцизногоТовара КАК КодВидаПодакцизногоТовара,
		|	Номенклатура.КоэффициентПересчета КАК КоэффициентПересчета,
		|	КодыВидовПодакцизныхТоваров.ВидТовара КАК ВидТовара,
		|	Номенклатура.ЕдиницаИзмеренияДляРасчетаАкциза КАК ЕдиницаИзмеренияДляРасчетаАкциза
		|ПОМЕСТИТЬ СписокНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыВидовПодакцизныхТоваров КАК КодыВидовПодакцизныхТоваров
		|		ПО Номенклатура.КодВидаПодакцизногоТовара = КодыВидовПодакцизныхТоваров.Ссылка
		|ГДЕ
		|	Номенклатура.Ссылка В(&СписокНоменклатуры)
		|	И ВЫБОР
		|			КОГДА КодыВидовПодакцизныхТоваров.ДействуетС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ КодыВидовПодакцизныхТоваров.ДействуетС <= &Дата
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА КодыВидовПодакцизныхТоваров.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ КодыВидовПодакцизныхТоваров.ДействуетПо >= &Дата
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокУчитываемыхПодакцизныхТоваров.ВидТовара КАК ВидТовара,
		|	СписокНоменклатуры.Ссылка КАК Ссылка,
		|	СписокНоменклатуры.КодВидаПодакцизногоТовара КАК КодВидаПодакцизногоТовара,
		|	СписокНоменклатуры.КоэффициентПересчета КАК КоэффициентПересчета,
		|	СписокНоменклатуры.ЕдиницаИзмеренияДляРасчетаАкциза КАК ЕдиницаИзмеренияДляРасчетаАкциза
		|ПОМЕСТИТЬ СписокНоменклатурыУчитываемойВТекОрганизации
		|ИЗ
		|	СписокУчитываемыхПодакцизныхТоваров КАК СписокУчитываемыхПодакцизныхТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ СписокНоменклатуры КАК СписокНоменклатуры
		|		ПО СписокУчитываемыхПодакцизныхТоваров.ВидТовара = СписокНоменклатуры.ВидТовара
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокНоменклатурыУчитываемойВТекОрганизации.Ссылка КАК Номенклатура,
		|	СписокНоменклатурыУчитываемойВТекОрганизации.КодВидаПодакцизногоТовара КАК КодВидаПодакцизногоТовара,
		|	СписокНоменклатурыУчитываемойВТекОрганизации.КоэффициентПересчета КАК КоэффициентПересчета,
		|	СписокНоменклатурыУчитываемойВТекОрганизации.ВидТовара КАК ВидТовара,
		|	СтавкиАкцизаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СтавкиАкцизаСрезПоследних.Сумма КАК Сумма,
		|	СтавкиАкцизаСрезПоследних.ОкруглятьДоЦелого КАК ОкруглятьДоЦелого,
		|	СписокНоменклатурыУчитываемойВТекОрганизации.ЕдиницаИзмеренияДляРасчетаАкциза.Код КАК ЕдиницаИзмеренияАкциза
		|ИЗ
		|	СписокНоменклатурыУчитываемойВТекОрганизации КАК СписокНоменклатурыУчитываемойВТекОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиАкциза.СрезПоследних(&Дата, ) КАК СтавкиАкцизаСрезПоследних
		|		ПО СписокНоменклатурыУчитываемойВТекОрганизации.КодВидаПодакцизногоТовара = СтавкиАкцизаСрезПоследних.КодВидаПодакцизногоТовара";
	
	Запрос.УстановитьПараметр("Организация",        Организация);
	Запрос.УстановитьПараметр("Дата",               Дата);
	Запрос.УстановитьПараметр("СписокНоменклатуры", ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаТовары, "Номенклатура", Истина));
	Запрос.УстановитьПараметр("Импорт",             ПараметрыДляЗаполнения.Импорт);
	Запрос.УстановитьПараметр("Производство",       Не ПараметрыДляЗаполнения.Импорт);

	Результат = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из ТаблицаТовары Цикл
		СтрокаПоАкцизу = Результат.Найти(Строка.Номенклатура, "Номенклатура");
		
		СобственныйЗапас = Истина;
		Если ЗначениеЗаполнено(Строка.Партия) И НЕ Строка.Партия.Статус = Перечисления.СтатусыПартий.СобственныеЗапасы Тогда
			СобственныйЗапас = Ложь;
		КонецЕсли;
				
		Если СтрокаПоАкцизу <> Неопределено И СобственныйЗапас Тогда 
			Строка.КоэффициентПересчета      = СтрокаПоАкцизу.КоэффициентПересчета;
			Строка.ЕдиницаИзмеренияАкциза    = СтрокаПоАкцизу.ЕдиницаИзмеренияАкциза;
			Строка.СтавкаАкциза = СтрокаПоАкцизу.Сумма;
			Строка.ОкруглятьДоЦелого         = СтрокаПоАкцизу.ОкруглятьДоЦелого;
			Строка.ПодакцизныйТовар = Истина;
			
			Если Строка.Свойство("ЕдиницаИзмерения") И ЗначениеЗаполнено(Строка.ЕдиницаИзмерения) 
				И Не ТипЗнч(Строка.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
				ЗначенияРекизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Строка.ЕдиницаИзмерения, "Коэффициент");
				Коэффициент = ?(Не ЗначениеЗаполнено(ЗначенияРекизитов.Коэффициент), 1, ЗначенияРекизитов.Коэффициент);
				Строка.СтавкаАкциза = Строка.СтавкаАкциза * Коэффициент;
			КонецЕсли;
			
			УчетАкцизовУНФКлиентСервер.РассчитатьСуммуАкцизаВТабЧасти(Строка, ПараметрыДляЗаполнения.ЭкспортПриРеализации,
			ПараметрыДляЗаполнения.Импорт, ПараметрыДляЗаполнения.ЭтоПередачаТоваров);
		Иначе
			Строка.КоэффициентПересчета      = 0;
			Строка.ЕдиницаИзмеренияАкциза = "";
			Если ПараметрыДляЗаполнения.ЗаявлениеОВвозе Тогда
				Строка.ТвердаяСтавкаАкциза = 0;
				
			Иначе
				Строка.СтавкаАкциза          = 0;
			КонецЕсли;
			Строка.ОкруглятьДоЦелого         = 0;
			Строка.ПодакцизныйТовар          = Ложь;
			Строка.СуммаАкциза               = 0;
			Если ПараметрыДляЗаполнения.Корректировка Тогда
				Строка.СуммаАкцизаДоИзменения     = 0;
				Строка.СуммаАкцизаДоКорректировки = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет список выбора видов подакцизного товара в зависимости от настроек
// 
// Параметры:
//  ЭлементФормы - ЭлементФормы - поле формы заполняемого списка.
//
Процедура ЗаполнитьСписокВидовПодакцизногоТовара(ЭлементФормы) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара,
	|	ПРЕДСТАВЛЕНИЕ(ПорядокУплатыАкцизов.ВидТовара) КАК Представление
	|ИЗ
	|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокУплатыАкцизов.ВидТовара.Порядок";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаСпискаВыбора = ЭлементФормы.СписокВыбора.Добавить();
		СтрокаСпискаВыбора.Значение = Выборка.ВидТовара;
		СтрокаСпискаВыбора.Представление = Выборка.Представление;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет строку табличной части данными акцизов
// 
// Параметры:
//  СтрокаТабличнойЧасти - СтрокаТабличнойЧасти - строка для заполнения.
//  ВидыПроизведенныхПодакцизныхТоваров - СписокЗначений - список видов произведенных подакцизных товаров.
//  ЭкспортПриРеализации - Булево - признак отгрузки в другую страну;
//  ЭтоПередачаТоваров - Булево - признак передачи товаров другому контрагенту;
//  ДатаОбработки - Дата - дата на которую получаются значения ставки акциза;
//
Процедура ЗаполнитьСтрокуДаннымиАкцизов(СтрокаТабличнойЧасти, ВидыПроизведенныхПодакцизныхТоваров, ЭкспортПриРеализации, ЭтоПередачаТоваров, ДатаОбработки) Экспорт
	
	СтруктураДанные = Новый Структура;
	
	СобстственныеЗапасы = Истина;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Партия) И Не СтрокаТабличнойЧасти.Партия.Статус = Перечисления.СтатусыПартий.СобственныеЗапасы Тогда
		СобстственныеЗапасы = Ложь;
	КонецЕсли;
	
	СтруктураДанные.Вставить("ПодакцизныйТовар", Ложь);
	СтруктураДанные.Вставить("СуммаАкциза", 0);
	СтруктураДанные.Вставить("КоэффициентПересчета", 0);
	СтруктураДанные.Вставить("СтавкаАкциза", 0);
	СтруктураДанные.Вставить("ОкруглятьДоЦелого", 0);
	СтруктураДанные.Вставить("ЕдиницаИзмеренияАкциза", "");
	
	Если СобстственныеЗапасы Тогда
		
		КодВидаПодакцизногоТовара = СтрокаТабличнойЧасти.Номенклатура.КодВидаПодакцизногоТовара;
		
		СтруктураДанные.Вставить("КоэффициентПересчета", СтрокаТабличнойЧасти.Номенклатура.КоэффициентПересчета);
		СтруктураДанные.Вставить("ЕдиницаИзмеренияДляРасчетаАкциза", СтрокаТабличнойЧасти.Номенклатура.ЕдиницаИзмеренияДляРасчетаАкциза);
		СтруктураДанные.КоэффициентПересчета = СтруктураДанные.КоэффициентПересчета;
		Если ЗначениеЗаполнено(СтруктураДанные.ЕдиницаИзмеренияДляРасчетаАкциза) Тогда
			ЕдиницаИзмеренияАкциза = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанные.ЕдиницаИзмеренияДляРасчетаАкциза, "Код");
		Иначе
			ЕдиницаИзмеренияАкциза = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(КодВидаПодакцизногоТовара) Тогда
			
			ВидТовара = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КодВидаПодакцизногоТовара, "ВидТовара");
			АкцизПоНоменклатуреНачисляется = ВидыПроизведенныхПодакцизныхТоваров.НайтиПоЗначению(ВидТовара);
			
			Если Не АкцизПоНоменклатуреНачисляется = Неопределено Тогда
				СтруктураДанные.ПодакцизныйТовар       = Истина;
				СтруктураДанные.ЕдиницаИзмеренияАкциза = ЕдиницаИзмеренияАкциза;
			КонецЕсли;
			
			Если СтруктураДанные.ПодакцизныйТовар И Не ЭкспортПриРеализации Тогда
				СтруктураРасчетаАкциза = УчетАкцизовУНФ.ПолучитьСтавкуАкциза(КодВидаПодакцизногоТовара, ДатаОбработки);
				СтруктураДанные.СтавкаАкциза      = СтруктураРасчетаАкциза.Ставка;
				СтруктураДанные.ОкруглятьДоЦелого = СтруктураРасчетаАкциза.ОкруглятьДоЦелого;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные);
	УчетАкцизовУНФКлиентСервер.РассчитатьСуммуАкцизаВТабЧасти(СтрокаТабличнойЧасти, ЭкспортПриРеализации, Ложь, ЭтоПередачаТоваров);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 Процедура ОбновитьСтавкиПоАлкогольнойПродукцииС01_05_2024(Параметры) Экспорт
	
	ЕстьУчетАкцизов = ПолучитьФункциональнуюОпцию("ПроизводствоПодакцизныхТоваров") Или ПолучитьФункциональнуюОпцию("ИмпортПодакцизныхТоваров");
	
	Если Не ЕстьУчетАкцизов Тогда 
		Возврат;
	КонецЕсли;
	
	ВидТовара = Перечисления.ВидыПодакцизныхТоваров.АлкогольнаяПродукция;
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПорядокУплатыАкцизов.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов
	|ГДЕ
	|	ПорядокУплатыАкцизов.ВидТовара = &ВидТовара";
	Запрос.УстановитьПараметр("ВидТовара", ВидТовара);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	НайтиСоздатьКодыПодакцизныхТоваров(ВидТовара,Истина);
	РегистрыСведений.СтавкиАкциза.ЗаполнитьСтавкиАкцизаПоВидуПодакцизногоТовара(ВидТовара, Истина);
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура НайтиСоздатьКодыПодакцизныхТоваров(ВидТовара, Обновление = Ложь)
	
	Макет = Справочники.КодыВидовПодакцизныхТоваров.ПолучитьМакет("КлассификаторКодов");
	ОбластьПоВидуТовара = Макет.Области.Найти(СтрЗаменить(ВидТовара, " ", ""));
	Если ОбластьПоВидуТовара <> Неопределено Тогда
		ОбластьПоВидуТовара = Макет.ПолучитьОбласть(СтрЗаменить(ВидТовара, " ", ""));
		Если Не Обновление Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КодыВидовПодакцизныхТоваров.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КодыВидовПодакцизныхТоваров КАК КодыВидовПодакцизныхТоваров
			|ГДЕ
			|	КодыВидовПодакцизныхТоваров.ВидТовара = &ВидТовара
			|	И КодыВидовПодакцизныхТоваров.ПометкаУдаления = ЛОЖЬ";
			Запрос.УстановитьПараметр("ВидТовара", ВидТовара);
			Результат = Запрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		КолвоСтрок = ОбластьПоВидуТовара.ВысотаТаблицы;
		Для Стр = 1 По КолВоСтрок Цикл
			КодВида = ОбластьПоВидуТовара.Область(Стр, 1);
			ВидПодакцизногоТовара = Справочники.КодыВидовПодакцизныхТоваров.НайтиПоКоду(КодВида.Текст);
			Если ВидПодакцизногоТовара = Неопределено Или ВидПодакцизногоТовара = Справочники.КодыВидовПодакцизныхТоваров.ПустаяСсылка() Тогда
				НовыйВид = Справочники.КодыВидовПодакцизныхТоваров.СоздатьЭлемент();
				НовыйВид.Код                = КодВида.Текст;
				НовыйВид.Наименование       = ОбластьПоВидуТовара.Область(Стр, 3).Текст;
				НовыйВид.НаименованиеПолное = ОбластьПоВидуТовара.Область(Стр, 2).Текст;
				НовыйВид.ВидТовара          = ВидТовара;
				НовыйВид.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура НайтиСоздатьКодыПодакцизныхТоваровС2025Года(ВидТовара, Обновление = Ложь, Перезаписать = Ложь)
	
	Макет = Справочники.КодыВидовПодакцизныхТоваров.ПолучитьМакет("КлассификаторКодов");
	ОбластьПоВидуТовара = Макет.Области.Найти(СтрЗаменить(ВидТовара, " ", ""));
	Если ОбластьПоВидуТовара <> Неопределено Тогда
		ОбластьПоВидуТовара = Макет.ПолучитьОбласть(СтрЗаменить(ВидТовара, " ", ""));
		Если Не Обновление Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	КодыВидовПодакцизныхТоваров.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КодыВидовПодакцизныхТоваров КАК КодыВидовПодакцизныхТоваров
			|ГДЕ
			|	КодыВидовПодакцизныхТоваров.ВидТовара = &ВидТовара
			|	И КодыВидовПодакцизныхТоваров.ПометкаУдаления = ЛОЖЬ";
			Запрос.УстановитьПараметр("ВидТовара", ВидТовара);
			Результат = Запрос.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		КолвоСтрок = ОбластьПоВидуТовара.ВысотаТаблицы;
		Для Стр = 1 По КолВоСтрок Цикл
			КодВида = ОбластьПоВидуТовара.Область(Стр, 1);
			ВидПодакцизногоТовара = Справочники.КодыВидовПодакцизныхТоваров.НайтиПоКоду(КодВида.Текст);
			Если ВидПодакцизногоТовара = Неопределено Или ВидПодакцизногоТовара = Справочники.КодыВидовПодакцизныхТоваров.ПустаяСсылка() Тогда
				НовыйВид = Справочники.КодыВидовПодакцизныхТоваров.СоздатьЭлемент();
				НовыйВид.Код                = КодВида.Текст;
				НовыйВид.Наименование       = ОбластьПоВидуТовара.Область(Стр, 3).Текст;
				НовыйВид.НаименованиеПолное = ОбластьПоВидуТовара.Область(Стр, 2).Текст;
				НовыйВид.ВидТовара          = ВидТовара;
				Если ОбластьПоВидуТовара.Область(Стр, 4).Текст <> "" Тогда
					НовыйВид.ДействуетС         = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОбластьПоВидуТовара.Область(Стр, 4).Текст, ЧастиДаты.Дата);
				КонецЕсли;
				Если ОбластьПоВидуТовара.Область(Стр, 5).Текст <> "" Тогда
					НовыйВид.ДействуетПо        = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОбластьПоВидуТовара.Область(Стр, 5).Текст, ЧастиДаты.Дата);
				КонецЕсли;
				НовыйВид.Записать();
			ИначеЕсли Перезаписать Тогда
				ПодакцизныйТовар = ВидПодакцизногоТовара.ПолучитьОбъект();
				ПодакцизныйТовар.Код                = КодВида.Текст;
				ПодакцизныйТовар.Наименование       = ОбластьПоВидуТовара.Область(Стр, 3).Текст;
				ПодакцизныйТовар.НаименованиеПолное = ОбластьПоВидуТовара.Область(Стр, 2).Текст;
				ПодакцизныйТовар.ВидТовара          = ВидТовара;
				Если ОбластьПоВидуТовара.Область(Стр, 4).Текст <> "" Тогда
					ПодакцизныйТовар.ДействуетС         = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОбластьПоВидуТовара.Область(Стр, 4).Текст, ЧастиДаты.Дата);
				КонецЕсли;
				Если ОбластьПоВидуТовара.Область(Стр, 5).Текст <> "" Тогда
					ПодакцизныйТовар.ДействуетПо        = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОбластьПоВидуТовара.Область(Стр, 5).Текст, ЧастиДаты.Дата);
				КонецЕсли;

				ПодакцизныйТовар.Записать();

			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСтавкиПоАкцизамС_01_01_2025(Параметры) Экспорт
	
	ЕстьУчетАкцизов = ПолучитьФункциональнуюОпцию("ПроизводствоПодакцизныхТоваров")
	Или ПолучитьФункциональнуюОпцию("ИмпортПодакцизныхТоваров");
	Если Не ЕстьУчетАкцизов Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПорядокУплатыАкцизов.ВидТовара КАК ВидТовара
	|ИЗ
	|	РегистрСведений.ПорядокУплатыАкцизов КАК ПорядокУплатыАкцизов";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайтиСоздатьКодыПодакцизныхТоваровС2025Года(Выборка.ВидТовара,Истина, Истина);
		РегистрыСведений.СтавкиАкциза.ЗаполнитьСтавкиАкцизаПоВидуПодакцизногоТовара(Выборка.ВидТовара, Истина);
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти
